---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarConstraintType.ToCover
enum: Autodesk.Revit.DB.Structure.RebarConstraintType
source: html/b9417455-214c-30ef-e055-ad17ff1e0db3.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraintType.ToCover

Handle is attached to the cover of a host Element surface.